/*

Направете програма, която извършва операцията “изключващо или” - XOR. От стандартния вход се четат две числа [0 (false) или 1 (true)] 
и в стандартния изход се извежда резултата от функцията - 0 или 1. 

Извикайте програмата, като прочетете числата от текстови файл numbers.txt.

Направете програма да работи и с три числа.

a | b | a^b     a | b | c | (a^b)^c
0 | 0 | 0       0 | 0 | 0 | 0
0 | 1 | 1       0 | 0 | 1 | 1
1 | 0 | 1       0 | 1 | 0 | 1
1 | 1 | 0       0 | 1 | 1 | 0
                1 | 0 | 0 | 1
                1 | 0 | 1 | 0
                1 | 1 | 0 | 0
                1 | 1 | 1 | 1

*/

#include <stdio.h>
int main()
{
    /*
    int a,b,result;
    scanf("%d", &a);
    scanf("%d", &b);
    if (1 == a+b)
    {
        result = 1;
    }else result = 0;
    */

    int a,b,c,result;
    scanf("%d", &a);
    scanf("%d", &b);
    scanf("%d", &c);
    if (1 == a+b+c || 3 == a+b+c)
    {
        result = 1;
    }else result = 0;
    
    return 0;
}